devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        if (wait_ready() != 0xFF) {
                return 0xFF;
        }

        /* send command packet */
        spi_rw(cmd);                    /* Start + Command index */
        spi_rw(arg >> 24);              /* Argument[31..24]      */
        spi_rw(arg >> 16);              /* Argument[23..16]      */
        spi_rw(arg >> 8);               /* Argument[15..8]       */
        spi_rw(arg);

        if (cmd == CMD0)
                spi_rw(0x95);           /* Valid CRC for CMD0(0) */
        else if (cmd == CMD8)
                spi_rw(0x87);           /* Valid CRC for CMD8(0x1AA) */
        else
                spi_rw(0x01);           /* Dummy CRC + Stop */

        /* receive command response */
        if (cmd == CMD12)
                spi_rw(0xFF);           /* Skip a stuff byte when stop reading */

        /* wait for a valid response in timeout of 10 attempts */
        int n = 10;
        do {
                response = spi_rw(0xFF);
        } while ((response & 0x80) && --n);

        return response;
}

//==============================================================================
/**
 * @brief Function receive data block
 *
 * @param[out] *buff            data buffer
 * @param[in]   size            buffer size
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool receive_data_block(u8_t *buff, uint size)
{
        u8_t token;
        uint try = 10000;

        while ((token = spi_rw(0xFF)) == 0xFF && --try);

        if (token != 0xFE)
                return false;

        /* memory alignment */
        do {
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
        } while (size -= 4);

        /* discard CRC */
        spi_rw(0xFF);
        spi_rw(0xFF);

        return true;
}

//==============================================================================
/**
 * @brief Function read whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of read sectors
 */
//==============================================================================
static size_t read_whole_sectors(struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_type & CT_BLOCK) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        if (nsectors == 1) {
                if (send_cmd(hdl, CMD17, (u32_t)lseek) == 0) {
                        if (receive_data_block(dst, SECTOR_SIZE)) {
                                n = 1;
                        }
                }
        } else {
                if (send_cmd(hdl, CMD18, (u32_t)lseek) == 0) {
                        do {
                                if (!receive_data_block(dst, 512)) {
                                        break;
                                }

                                dst += SECTOR_SIZE;
                        } while (++n < nsectors);

                        /* stop transmission */
                        send_cmd(hdl, CMD12, 0);
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read only selected data from sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static size_t read_partial_sectors(struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(SECTOR_SIZE);
        if (!buffer)
                return 0;

        u32_t recv_data  = 0;
        while (recv_data < size) {
                if (lseek % SECTOR_SIZE == 0 && (size - recv_data) / SECTOR_SIZE > 0) {
                        size_t n = read_whole_sectors(hdl, dst, size / SECTOR_SIZE, lseek);
                        if (n != size / SECTOR_SIZE)
                                break;

                        dst       += n * SECTOR_SIZE;
                        lseek     += n * SECTOR_SIZE;
                        recv_data += n * SECTOR_SIZE;
                } else {
                        if (read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF)) != 1)
                                break;

                        u32_t rest;
                        if ((SECTOR_SIZE - (lseek % SECTOR_SIZE)) > (size - recv_data))
                                rest = size - recv_data;
                        else
                                rest = SECTOR_SIZE - (lseek % SECTOR_SIZE);

                        memcpy(dst, buffer + (lseek % SECTOR_SIZE), rest);
                        dst       += rest;
                        recv_data += rest;
                        lseek     += rest;
                }
        }

        free(buffer);

        return recv_data;
}

//==============================================================================
/**
 * @brief Function initialize card
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t initialize_card(struct sdspi_data *hdl)
{
#include "core/io.h" /* FIXME -- niepotrzebne */
        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        for (int n = 0; n < 10; n++) {
                spi_rw(0xFF);
        }

        int  timeout = 2 * SDSPI_WAIT_TIMEOUT;
        u8_t cmd;
        u8_t OCR[4];

        hdl->card_type = 0;
        hdl->card_initialized = false;

        if (send_cmd(hdl, CMD0, 0) == 0x01) {
                if (send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                        for (int n = 0; n < 4; n++) {
                                OCR[n] = spi_rw(0xFF);
                        }

                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                while (--timeout && send_cmd(hdl, ACMD41, 1UL << 30)) {
                                        sleep_ms(1);
                                }

                                if (timeout && send_cmd(hdl, CMD58, 0) == 0) {
                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_rw(0xFF);
                                        }

                                        hdl->card_type = (OCR[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
                                }
                        }
                } else { /* SDSC or MMC */
                        if (send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                hdl->card_type = CT_SD1;
                                cmd = ACMD41;   /* SDSC */
                        } else {
                                hdl->card_type = CT_MMC;
                                cmd = CMD1;     /* MMC */
                        }

                        /* Wait for leaving idle state */
                        while (timeout && send_cmd(hdl, cmd, 0)) {
                                timeout--;
                                sleep_ms(1);
                        }

